Autodesk.Revit.DB.Structure.PathReinSpanSymbol.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.LinkElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ElementId)
Creates a new instance of PathReinSpanSymbol in the project.
document:
The document.
viewId:
The id of the view in which the symbol should appear.
hostId:
The ElementId of PathReinforcement (either in the document, or linked from another document).
point:
The span symbol's head position.
symbolId:
The family symbol id of this element.
Returns:
A reference to newly created span symbol.
Throws Autodesk.Revit.Exceptions.ArgumentException:
hostId should refer to a PathReinforcement element.
-or-
viewId does not refer to a valid view type for FabricReinSpanSymbol - only floor plan, reflected ceiling plans and elevations are permitted.
-or-
symbolId should refer to a FamilySymbol of category OST_FabricReinSpanSymbol.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.PathReinSpanSymbol
Represents a Path Reinforcement Span Symbol element in Autodesk Revit.